In [2]:
import pandas as pd
df = pd.read_csv('./data/scores.csv')
df.index = 'i' + df.index.astype('str')
df.head()

       name    kor    eng   math
i0    Aiden  100.0   90.0   95.0
i1  Charles   90.0   80.0   75.0
i2   Danial   95.0  100.0  100.0
i3     Evan  100.0  100.0  100.0
i4    Henry    NaN   35.0   60.0

# 행번호, 열번호

![nn](./screenshot/10.PNG)

- 행 번호는 별도로 지정할 수 없으며, 0번부터 1씩 증가한다. 해당 행의 위치를 나타낸다.
- 열 번호는 별도로 지정할 수 없으며, 0번부터 1씩 증가한다. 해당 열의 위치를 나타낸다.
- 인덱스는 각 행에 이름을 부여한 것이다. 따라서 따로 설정할 수 있다. 디폴트 값은 0부터 1씩 증가한다.
- 컬럼명은 각 열에 이름을 부여한 것이다. 따라서 따로 설정할 수 있다. 디폴트 값은 a부터 알파벳 소문자 별로 증가한다.

## 1. 행 번호로 행 데이터 추출하기 : df.iloc
```
df.iloc[행번호]
df.iloc[행번호 리스트]
df.iloc[행번호 슬라이스]
```

- 음수를 사용하면 행번호를 뒤에서부터 센다.

In [3]:
df.head()

       name    kor    eng   math
i0    Aiden  100.0   90.0   95.0
i1  Charles   90.0   80.0   75.0
i2   Danial   95.0  100.0  100.0
i3     Evan  100.0  100.0  100.0
i4    Henry    NaN   35.0   60.0

### 1.1  시리즈 형태로 추출하기

In [5]:
# 0번쨰 행 추출하기
df.iloc[0]

name    Aiden
kor     100.0
eng      90.0
math     95.0
Name: i0, dtype: object

### 1.2 데이터프레임 형태로 추출하기

In [6]:
# 1, 3, 5번쨰 행 추출하기
df.iloc[[1, 3, 5]]

       name    kor    eng   math
i1  Charles   90.0   80.0   75.0
i3     Evan  100.0  100.0  100.0
i5      Ian   90.0  100.0   90.0

In [7]:
# 0번쨰 행 데이터프레임으로 출력하기
df.iloc[[0]]

     name    kor   eng  math
i0  Aiden  100.0  90.0  95.0

In [8]:
# type
type(df.iloc[[0]])

pandas.core.frame.DataFrame

### 1.3 행번호 슬라이스로 추출하기

In [10]:
# 1~3행 추출하기
df.iloc[1:4]

       name    kor    eng   math
i1  Charles   90.0   80.0   75.0
i2   Danial   95.0  100.0  100.0
i3     Evan  100.0  100.0  100.0

In [12]:
# 1, 3, 5행 추출하기
df.iloc[1:6:2]

       name    kor    eng   math
i1  Charles   90.0   80.0   75.0
i3     Evan  100.0  100.0  100.0
i5      Ian   90.0  100.0   90.0

In [13]:
# 1행 추출하기
df.iloc[1:2]

       name   kor   eng  math
i1  Charles  90.0  80.0  75.0

In [16]:
# 짝수 행번호의 데이터 출력하기
df.iloc[::2]
# df.iloc[0::2]

         name    kor    eng   math
i0      Aiden  100.0   90.0   95.0
i2     Danial   95.0  100.0  100.0
i4      Henry    NaN   35.0   60.0
i6      James   70.0   75.0   65.0
i8     Justin   50.0   60.0  100.0
i10       Leo   90.0   95.0   70.0
i12     Peter  100.0   95.0  100.0
i14     Chloe   95.0  100.0   95.0
i16     Ellen    NaN   60.0    NaN
i18  Jennifer   80.0   55.0   80.0
i20     Linda  100.0   90.0  100.0
i22      Rose   70.0   65.0   70.0
i24   Tiffany   90.0    NaN   90.0
i26   Viviana  100.0   80.0  100.0
i28    Winnie   70.0  100.0   70.0

In [17]:
# 홀수 행번호의 데이터 추출하기
df.iloc[1::2]

        name    kor    eng   math
i1   Charles   90.0   80.0   75.0
i3      Evan  100.0  100.0  100.0
i5       Ian   90.0  100.0   90.0
i7    Julian   80.0   90.0   55.0
i9     Kevin  100.0  100.0   90.0
i11   Oliver   70.0   75.0   65.0
i13      Amy   90.0   75.0   90.0
i15    Danna  100.0  100.0  100.0
i17     Emma   70.0   65.0   70.0
i19     Kate   50.0    NaN   50.0
i21   Olivia   90.0   70.0   90.0
i23    Sofia  100.0  100.0  100.0
i25  Vanessa   95.0   70.0   95.0
i27   Vikkie    NaN   50.0  100.0
i29     Zuly   80.0   90.0   95.0

### 1.4 음수 행번호로 추출하기

In [18]:
# 마지막행 추출하기
df.iloc[-1]

name    Zuly
kor     80.0
eng     90.0
math    95.0
Name: i29, dtype: object

In [22]:
# 마지막 2개 행 추출하기 (리스트)
df.iloc[[-2, -1]]

       name   kor    eng  math
i28  Winnie  70.0  100.0  70.0
i29    Zuly  80.0   90.0  95.0

In [24]:
# 마지막 2개 행 추출하기 (슬라이스)
df.iloc[-2:]

       name   kor    eng  math
i28  Winnie  70.0  100.0  70.0
i29    Zuly  80.0   90.0  95.0

![nn](./screenshot/11.PNG)

## 2. 행 번호로 행, 열 추출하기

In [26]:
df.head()

       name    kor    eng   math
i0    Aiden  100.0   90.0   95.0
i1  Charles   90.0   80.0   75.0
i2   Danial   95.0  100.0  100.0
i3     Evan  100.0  100.0  100.0
i4    Henry    NaN   35.0   60.0

### 2.1 iloc[행번호, 열번호]

In [25]:
# 0번쨰 행, 0번쨰 열
df.iloc[0, 0]

'Aiden'

### 2.2 iloc[행번호, 열번호리스트]

In [28]:
# 0번째 행, kor, eng
df.iloc[0, [1, 2]]
# kor, eng는 각각 1번째, 2번째 열이기 떄문 - 이름 : 0번째 열

kor    100.0
eng     90.0
Name: i0, dtype: object

### 2.3 iloc[행번호리스트, 열번호]

In [29]:
# 1, 3, 4번째 행 kor
df.iloc[[1, 3, 4], 1]

i1     90.0
i3    100.0
i4      NaN
Name: kor, dtype: float64

### 2.4 iloc[행번호리스트, 열번호리스트]

In [30]:
# 1, 3, 4번쨰 행 name, eng
df.iloc[[1, 3, 4], [0, 2]]

       name    eng
i1  Charles   80.0
i3     Evan  100.0
i4    Henry   35.0

### 2.5 iloc[행번호슬라이싱, 열번호슬라이싱]
- iloc에서는 슬라이싱을 사용할 수 있다.
- iloc에서는 음수를 사용할 수 있다.

In [31]:
df.head()

       name    kor    eng   math
i0    Aiden  100.0   90.0   95.0
i1  Charles   90.0   80.0   75.0
i2   Danial   95.0  100.0  100.0
i3     Evan  100.0  100.0  100.0
i4    Henry    NaN   35.0   60.0

In [32]:
# 0, 1번째 행 0, 1번째 열 슬라이싱
df.iloc[:2, :2]

       name    kor
i0    Aiden  100.0
i1  Charles   90.0

In [33]:
# 1, 3, 5번쨰 행, 0,2번째 열 슬라이싱
df.iloc[1:6:2, 0:3:2]

       name    eng
i1  Charles   80.0
i3     Evan  100.0
i5      Ian  100.0

In [34]:
df.tail()

        name    kor    eng   math
i25  Vanessa   95.0   70.0   95.0
i26  Viviana  100.0   80.0  100.0
i27   Vikkie    NaN   50.0  100.0
i28   Winnie   70.0  100.0   70.0
i29     Zuly   80.0   90.0   95.0

In [37]:
# 마지막행 1, 3열 슬라이싱
df.iloc[-1, 1::2]

kor     80.0
math    95.0
Name: i29, dtype: object

In [40]:
# 모든 행, 1열
df.iloc[:, 1:2].tail() # DataFrame
# df.iloc[:, 1].tail() # Series

       kor
i25   95.0
i26  100.0
i27    NaN
i28   70.0
i29   80.0

In [41]:
# 모든 행, 1, 2열
df.iloc[:, 1:3].tail()

       kor    eng
i25   95.0   70.0
i26  100.0   80.0
i27    NaN   50.0
i28   70.0  100.0
i29   80.0   90.0